namespace Locust.Text
{
    public class NumberFa: Number
    {
        public NumberFa(int n): base(n, "fa")
        {
            zero = "صفر";
            and = " و ";
            and2 = " و ";
            and3 = " و ";
            ones = new string[] { "", "یک", "دو", "سه", "چهار", "پنج", "شش", "هفت", "هشت", "نه" };
            teens = new string[] { "ده", "یازده", "دوازده", "سیزده", "چهارده", "پانزده", "شانزده", "هفده", "هجده", "نوزده" };
            tens = new string[] { "بیست", "سی", "چهل", "پنجاه", "شصت", "هفتاد", "هشتاد", "نود" };
            hundreds = new string[] { "صد", "دویست", "سیصد", "چهارصد", "پانصد", "ششصد", "هفتصد", "هشتصد", "نهصد" };
            units = new string[] { "", "هزار", "میلیون", "میلیارد", "تریلیون", "کوادریلیون", "کوینتیلیون", "سکستیلیون", "سپتیلیون", "اکتیلیون", "نانیلیون" };
        }
    }
}
